//
// Created by Teodora on 11/5/2023.
// Напишете програма која од стандарден влез (тастатура) ќе прочита три цели броја A, B и C
// (кои соодветствуваат на проблемот A#B=C), ќе одреди кој од аритметичките оператори (+, -, *, /)
// треба да се постави на местото на # (помеѓу A и B) за да равенката (A#B=C) биде задоволена,
// и потоана стандарден излез ќе ја отпечати равенката A#B=C
// (нормално, на местото на # треба да стои бараниот оператор).
#include<iostream>
using namespace std;

int main(){
    int A, B, C;
    char op;
    cin>>A>>B>>C;
    if(A+B==C){
        op='+';
    }
    else if(A-B==C){
        op='-';
    }
    else if(A*B==C){
        op='*';
    }
    else
        op='/';
    cout<<A<<op<<B<<"="<<C;
    return 0;
}
