//
// Created by Teodora on 1/4/2024.
//
/*
 * Од страндарден влез се внесуваат N (N<100)  позитивни цели броеви (прво се внесува бројот на броеви кои ќе бидат внесени а потоа и броевите).
 * Да се напише програма која на стандарден излез ќе ги испечати сите броеви кои го исполнуваат дадениот критериум во истиот редослед во кој се појавуваат на влезот.
 * Критериумот е следен: најмногу значајната цифра (цифрата на најлевата позиција) е парна и се наоѓа на парна позиција или најмногу значајната цифра е непарна
 * и се наоѓа на непарна позиција. Се смета дека најмалку значајната цифра во бројот се наоѓа на 1ва позиција.Ако во внесените броеви не постои ниту еден таков број,
 * треба да се испечати порака "No such number".При имплементација, проверката дали даден број го исполнува дадениот критериум треба да се реализира во посебна функција.
*/
#include<iostream>
using namespace std;

int kriterium(int broevi) {
    int pozicija = 1;
    while(broevi >= 10){
        pozicija++;
        broevi /= 10;
    }
    if((pozicija % 2 == 0 && broevi % 2 == 0) ||
       (pozicija % 2 != 0 && broevi % 2 != 0)){
        return 1;
    }
    return 0;
}

int main(){
    int n, broevi;
    cin>>n;
    int najden = 0;
    for (int i = 0; i < n; ++i) {
        cin>>broevi;
        if(kriterium(broevi)){
            cout<<broevi<<endl;
            najden = 1;
        }
    }
    if(najden == 0){
        cout<<"No such number"<<endl;
    }
    return 0;
}
