//
// Created by Teodora on 1/4/2024.
//
/*
 * За еден природен број а велиме дека е порамнување на друг природен број b ако и само ако цифрите еднакви на 9
 * во бројот b се заменети со цифрата 7 во бројот а. Пример: Бројот 734775 е порамнување на бројот 934795.
 * Од стандарден влез се внесуваат непознат број на цели броеви, се додека не се внесе нешто што
 * не може да се интерпретира како цел број. Ваша задача е да ги отпечатите најмалите 5 од порамнувањата на сите
 * внесени броеви, по редослед од најмалиот кон најголемиот.
 * Забелешка: Доколку се внесат помалку од 5 броеви, тогаш печатите толку броеви колку што се соодветно внесени.
 * Наоѓањето на порамнувањето на даден број треба да се реализира во посебна функција poramnet(int a).

 * Пример: За броевите: 9592, 69403, 100007, 6, 987, 6977, 33439,
 * треба да се најдат нивните порамнувања ( тоа се: 7572, 67403, 100007, 6, 787, 6777 и 33437, соодветно),
 * и да се отпечатат најмалите 5 од нив по овој редослед: 6 787 6777 7572 33437.
 */
#include<iostream>
using namespace std;

int poramnet(int a)
{
    if(a == 0)
        return 0;
    if(a % 10 == 9)
        return 7 + 10 * poramnet(a / 10);
    return a % 10 + 10 * poramnet(a / 10);
}

void bubbleSort(int array[], int size) {
    for (int i = 0; i < size; i++) {
        for (int j = 0; j < size - 1 - i; j++) {
            if (array[j]>array[j+1]){
                swap(array[j],array[j+1]);
            }
        }
    }
}

int main(){
    int n=0,i,niza[100],broj;
    while(cin>>broj){
        niza[n] = poramnet(broj);
        n++;
    }

    bubbleSort (niza,n);

    if (n>5){
        n = 5;
    }

    for (i=0;i<n;i++){
        cout<<niza[i]<<" ";
    }
    return 0;
}