//
// Created by Teodora on 1/5/2024.
//
/*
 * Од страндарден влез се внесуваат N (N<100)  позитивни цели броеви (прво се внесува бројот на броеви кои ќе бидат внесени а потоа и броевите).
 * Да се напише програма која на стандарден излез ќе ги испечати сите броеви кои го исполнуваат дадениот критериум во истиот редослед во кој се појавуваат на влезот.
 * Критериумот е следен: најмногу значајната цифра (цифрата на најлевата позиција) е парна и се наоѓа на парна позиција или најмногу значајната цифра е непарна
 * и се наоѓа на непарна позиција. Се смета дека најмалку значајната цифра во бројот се наоѓа на 1ва позиција.Ако во внесените броеви не постои ниту еден таков број,
 * треба да се испечати порака "No such number".При имплементација, проверката дали даден број го исполнува дадениот критериум треба да се реализира во посебна функција.
 */
#include<iostream>
using namespace std;

int kriterium1(int broj)
{
    if(broj < 10)
        return broj;
    return kriterium1(broj/10);
}

int kriterium2(int broj) {
    if(broj < 10)
        return 0;
    return 1 + kriterium1(broj/10);
}

int main(){
    int n;
    int broj;
    int najden = 0;
    cin>>n;
    for (int i = 0; i < n; ++i) {
        cin>>broj;
        if((kriterium1(broj) && kriterium2(broj)) % 2 == 0){
            cout<<broj<<endl;
            najden = 1;
        }
    }
    if(najden == 0){
        cout<<"No such a number"<<endl;
    }
    return 0;
}